# AddClippingsToBaseExtrusion Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..AddClippingsToBaseExtrusion Method
ExporterIFCUtils Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static IFCAnyHandle AddClippingsToBaseExtrusion(
	ExporterIFC exporterIFC,
	Wall wall,
	XYZ setterOffset,
	IFCRange range,
	IFCRange zSpan,
	IFCAnyHandle baseBodyItemHandle,
	out IList<IFCExtrusionData> pCutPairOpenings
)
```

Visual Basic
---
```text
Public Shared Function AddClippingsToBaseExtrusion ( _
	exporterIFC As ExporterIFC, _
	wall As Wall, _
	setterOffset As XYZ, _
	range As IFCRange, _
	zSpan As IFCRange, _
	baseBodyItemHandle As IFCAnyHandle, _
	<OutAttribute> ByRef pCutPairOpenings As IList(Of IFCExtrusionData) _
) As IFCAnyHandle
```

Visual C++
---
```text
public:
static IFCAnyHandle^ AddClippingsToBaseExtrusion(
	ExporterIFC^ exporterIFC,
	Wall^ wall,
	XYZ^ setterOffset,
	IFCRange^ range,
	IFCRange^ zSpan,
	IFCAnyHandle^ baseBodyItemHandle,
	[OutAttribute] IList<IFCExtrusionData^>^% pCutPairOpenings
)
```

# ### Parameters
exporterIFC
    Type: Autodesk.Revit.DB.IFC..::..ExporterIFC
wall
    Type: Autodesk.Revit.DB..::..Wall
setterOffset
    Type: Autodesk.Revit.DB..::..XYZ
range
    Type: Autodesk.Revit.DB.IFC..::..IFCRange
zSpan
    Type: Autodesk.Revit.DB.IFC..::..IFCRange
baseBodyItemHandle
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle
pCutPairOpenings
    Type: System.Collections.Generic..::..IList<(Of <(<'IFCExtrusionData>)>)>%
# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace